 
Функция МожетБытьДробным(ЕдиницаИзмерения) Экспорт	
	Возврат ПерерасчетСуммСервер.МожетБытьДробнымНаСервере(ЕдиницаИзмерения); 
КонецФункции 

Функция ПолучитьСкидку(Договор) Экспорт
	Возврат ПерерасчетСуммСервер.ПолучитьСкидкуНаСервере(Договор);	
КонецФункции

Функция ПолучитьСкидкиНаПродукты(МассивПродуктов, Дата) Экспорт
	Возврат ПерерасчетСуммСервер.ПолучитьСкидкиНаПродуктыНаСервере(МассивПродуктов, Дата);
КонецФункции 

Функция ПолучитьСкидкуИзДоговора(Договор, Дата)Экспорт
	Возврат ПерерасчетСуммСервер.ПолучитьСкидкуИзДоговораНаСервере(Договор, Дата);
КонецФункции

Функция ПолучитьЦеныНаБлюда(МассивБлюд, Дата) Экспорт
	Возврат	ПерерасчетСуммСервер.ПолучитьЦеныНаБлюдаНаСервере(МассивБлюд, Дата);
КонецФункции








