
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СоставБлюд
	Движения.СоставБлюдИстория.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.СоставБлюдИстория.Добавить();
		Движение.Период = Дата;
		Движение.Блюдо = Блюдо;
		Движение.Продукт = ТекСтрокаСостав.Продукт;
		Движение.Количество = ТекСтрокаСостав.Количество;
		Движение.Ответственный = Ответственный;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
