
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого Строка из Блюда Цикл
		
		Движения.ИнгредиентыВНаличии.Записывать = Истина;
		Движение = Движения.ИнгредиентыВНаличии.Добавить();
		
		Движение.Период = Дата;
		Движение.Заведение = Склад;
		Движение.Номенклатура = Строка.Блюдо;
		Движение.Сумма = 0;
		
		Если Строка.КоличествоФакт > Строка.КоличествоОстаток Тогда
			
			Движение.Количество = Строка.КоличествоФакт - Строка.КоличествоОстаток;	
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			
		Иначе
			
			Движение.Количество =  Строка.КоличествоОстаток - Строка.КоличествоФакт;	
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			
		КонецЕсли;
			    
	КонецЦикла;
	
	Для Каждого Строка из Ингредиенты Цикл
		
		Движения.ИнгредиентыВНаличии.Записывать = Истина;
		Движение = Движения.ИнгредиентыВНаличии.Добавить();
		
		Движение.Период = Дата;
		Движение.Заведение = Склад;
		Движение.Номенклатура = Строка.Продукт;
		Движение.Сумма = 0;
		
		Если Строка.КоличествоФакт > Строка.КоличествоОстаток Тогда
			
			Движение.Количество = Строка.КоличествоФакт - Строка.КоличествоОстаток;	
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			
		Иначе
			
			Движение.Количество =  Строка.КоличествоОстаток - Строка.КоличествоФакт;	
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			
		КонецЕсли;
			    
	КонецЦикла;


	
КонецПроцедуры
