
&НаСервере
Процедура ЗаказПокупателяПриИзмененииНаСервере()
	
	Блюда.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяБлюда.Блюдо КАК Блюдо,
		|	ЗаказПокупателяБлюда.Количество КАК Количество,
		|	ЗаказПокупателяБлюда.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ЗаказПокупателя.Блюда КАК ЗаказПокупателяБлюда
		|ГДЕ
		|	ЗаказПокупателяБлюда.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаказПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		 СтрокаТаблицыБлюд = Блюда.Добавить();
		 ЗаполнитьЗначенияСвойств(СтрокаТаблицыБлюд, ВыборкаДетальныеЗаписи);
		 //СтрокаТаблицыБлюд.Блюдо = ВыборкаДетальныеЗаписи.Блюдо;
		 //СтрокаТаблицыБлюд.Количество = ВыборкаДетальныеЗаписи.Количество;
		 //СтрокаТаблицыБлюд.Комментарий = ВыборкаДетальныеЗаписи.Комментарий; 
		 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПокупателяПриИзменении(Элемент)
	ЗаказПокупателяПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БлюдаПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.Блюда.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Ингредиенты.Параметры.УстановитьЗначениеПараметра("КоличествоБлюд", ТекущиеДанные.Количество);
		Ингредиенты.Параметры.УстановитьЗначениеПараметра("ТекущееБлюдо", ТекущиеДанные.Блюдо);  
		
	Иначе
		
		Ингредиенты.Параметры.УстановитьЗначениеПараметра("ТекущееБлюдо", ПредопределенноеЗначение("Справочник.Блюда.ПустаяСсылка")); 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСекундомер(Команда)
	
	Если Элементы.ЗапуститьСекундомер.Заголовок = "Остановить секундомер" Тогда
		
		ОтключитьОбработчикОжидания("ЗапуститьСекундомерОбработчик");
		Элементы.ЗапуститьСекундомер.Заголовок = "Запустить секундомер";
		
	Иначе              
		
		ПодключитьОбработчикОжидания("ЗапуститьСекундомерОбработчик", 1);
		Элементы.ЗапуститьСекундомер.Заголовок = "Остановить секундомер";
	
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСекундомерОбработчик() Экспорт
	
	Секундомер = Секундомер + 1;
	
КонецПроцедуры


&НаСервере
Процедура ИзменениеСтатусаЗаказаНаСервере(Статус)
	
	 ОбъектЗаказ = ЗаказПокупателя.ПолучитьОбъект();
	 ОбъектЗаказ.СтатусЗаказа = Перечисления.СтатусыЗаказов[Статус];
	 ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры


&НаКлиенте
Процедура ИзменениеСтатусаЗаказа(Команда)
	
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		
		Если Элементы.ИзменениеСтатусаЗаказа.Заголовок = "Взять в работу" Тогда
		
			ИзменениеСтатусаЗаказаНаСервере("ВзятВРаботу");
			Элементы.ИзменениеСтатусаЗаказа.Заголовок = "Готов";
			Элементы.ЗаказПокупателя.ТолькоПросмотр = Истина;
		
		Иначе  
		
			ИзменениеСтатусаЗаказаНаСервере("Готов");
			Элементы.ИзменениеСтатусаЗаказа.Заголовок = "Взять в работу";
			Элементы.ЗаказПокупателя.ТолькоПросмотр = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтменитьЗаказ(Команда)
	
	Ответ = Неопределено;

	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтменитьЗаказЗавершение", ЭтотОбъект), "Ты уверен маленький поварёнок?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаказЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ИзменениеСтатусаЗаказаНаСервере("Новый");
		Элементы.ИзменениеСтатусаЗаказа.Заголовок = "Взять в работу";
		Элементы.ЗаказПокупателя.ТолькоПросмотр = Ложь; 
	КонецЕсли;
	
КонецПроцедуры


