&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ПроверкаРолиНаСервере.ЕстьРоль("Директор") Тогда
		УстановитьПривилегированныйРежим(Истина);
		Объект.Заведение = ПараметрыСеанса.ТекущийСотрудник.Заведение;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Заведение) Тогда
		
		Объект.Блюда.Очистить();
		Объект.Ингредиенты.Очистить();
		Возврат;
		
	КонецЕсли;
	
	
	Склады = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		
		Выборка = Справочники.Склады.Выбрать( , Объект.Заведение);
		Пока Выборка.Следующий() Цикл
			Склады.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	Иначе
		
		Склады.Добавить(Объект.Склад);
		
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнгредиентыВНаличииОстатки.Номенклатура КАК Блюдо,
		|	ИнгредиентыВНаличииОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ИнгредиентыВНаличии.Остатки КАК ИнгредиентыВНаличииОстатки
		|ГДЕ
		|	ИнгредиентыВНаличииОстатки.Заведение В (&Склады)
		|	И ИнгредиентыВНаличииОстатки.Номенклатура ССЫЛКА Справочник.Блюда";
	
	Запрос.УстановитьПараметр("Склады", Склады);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.Блюда.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЧ = Объект.Блюда.Добавить();
		СтрокаТЧ.Блюдо = ВыборкаДетальныеЗаписи.Блюдо;
		СтрокаТЧ.КоличествоОстаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		СтрокаТЧ.ТолькоПросмотр = Истина;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнгредиентыВНаличииОстатки.Номенклатура КАК Продукт,
		|	ИнгредиентыВНаличииОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ИнгредиентыВНаличии.Остатки КАК ИнгредиентыВНаличииОстатки
		|ГДЕ
		|	ИнгредиентыВНаличииОстатки.Заведение В (&Склады)
		|	И ИнгредиентыВНаличииОстатки.Номенклатура ССЫЛКА Справочник.Продукты";
	
	Запрос.УстановитьПараметр("Склады", Склады);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.Ингредиенты.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаТЧ = Объект.Ингредиенты.Добавить();
		СтрокаТЧ.Продукт = ВыборкаДетальныеЗаписи.Продукт;
		СтрокаТЧ.КоличествоОстаток = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		СтрокаТЧ.ТолькоПросмотр = Истина;
	
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	//Элементы.Блюда.ИзменятьСоставСтрок = Ложь;
	//Элементы.Ингредиенты.ИзменятьСоставСтрок = Ложь;
		
КонецПроцедуры

&НаКлиенте
Процедура БлюдаПередУдалением(Элемент, Отказ)
	Отказ = Элемент.ТекущиеДанные.ТолькоПросмотр;
КонецПроцедуры

&НаКлиенте
Процедура ИнгредиентыПередУдалением(Элемент, Отказ)
	Отказ = Элемент.ТекущиеДанные.ТолькоПросмотр
КонецПроцедуры


