&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ПроверкаРолиНаСервере.ЕстьРоль("Директор") Тогда
		УстановитьПривилегированныйРежим(Истина);
		Объект.Заведение = ПараметрыСеанса.ТекущийСотрудник.Заведение;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		СоставБлюда.Параметры.УстановитьЗначениеПараметра("КоличествоБлюд", ТекущиеДанные.Количество);
		СоставБлюда.Параметры.УстановитьЗначениеПараметра("ТекущееБлюдо", ТекущиеДанные.Номенклатура);  
		
	Иначе
		
		СоставБлюда.Параметры.УстановитьЗначениеПараметра("ТекущееБлюдо", ПредопределенноеЗначение("Справочник.Блюда.ПустаяСсылка")); 
		
	КонецЕсли;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТоварыПриИзмененииНаСервере(Блюдо, Дата)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Цены.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныБлюд.СрезПоследних(&ДатаДокумента, Блюдо = (&Блюдо)) КАК Цены";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Блюдо", Блюдо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.Цена;

		
КонецФункции

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.РекомендуемаяЦена = ТоварыПриИзмененииНаСервере(ТекущиеДанные.Номенклатура, Объект.Дата);	
	ТоварыПриАктивизацииСтроки(Элемент);	
КонецПроцедуры

&НаКлиенте
Процедура ПерерасчетЦенНаБлюда()
	Блюда = Объект.Товары;
	МассивБлюд = Новый Массив;
	Для Каждого Строка Из Блюда Цикл
		МассивБлюд.Добавить(Строка.Номенклатура);
	КонецЦикла;
	
	ЦеныНаБлюда = ПерерасчетСуммКлиент.ПолучитьЦеныНаБлюда(МассивБлюд, Объект.Дата);
	Для Каждого Строка Из Блюда Цикл
		Строка.РекомендуемаяЦена = ЦеныНаБлюда[Строка.Номенклатура];
	КонецЦикла;
КонецПроцедуры 
     
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПерерасчетЦенНаБлюда();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	РасчетСуммы();	                     
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	РасчетСуммы();
КонецПроцедуры 

&НаКлиенте
Процедура РасчетСуммы()
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
			
КонецПроцедуры   

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Если ТекущиеДанные.Цена <> 0 Тогда
		ТекущиеДанные.Количество = ТекущиеДанные.Сумма / ТекущиеДанные.Цена;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПерерасчетЦенНаБлюда();
КонецПроцедуры





