&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ПроверкаРолиНаСервере.ЕстьРоль("Директор") Тогда
		УстановитьПривилегированныйРежим(Истина);
		Объект.Заведение = ПараметрыСеанса.ТекущийСотрудник.Заведение;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура ДоговорПриИзмененииНаСервере() 
	Договор = Объект.Договор;
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВзаиморасчётыОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Взаиморасчёты.Остатки КАК ВзаиморасчётыОстатки
	|ГДЕ
	|	ВзаиморасчётыОстатки.Договор = &Договор";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Выборка = Запрос.Выполнить().Выбрать();
 	Выборка.Следующий();
	
	Если Выборка.СуммаОстаток <> Неопределено Тогда
		Объект.СуммаЗадолженности = -Выборка.СуммаОстаток;
	Иначе
		Объект.СуммаЗадолженности = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент) 
  	ДоговорПриИзмененииНаСервере();
КонецПроцедуры