
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Взаиморасчёты Расход
	Движения.Взаиморасчёты.Записывать = Истина;
	Для Каждого ТекСтрокаПоступления Из Поступления Цикл
		Движение = Движения.Взаиморасчёты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Поставщик = ТекСтрокаПоступления.Поставщик;
		Движение.Договор = ТекСтрокаПоступления.Договор;
		Движение.Сумма = ТекСтрокаПоступления.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
