
&НаКлиенте
Процедура ЗаполнитьТаблицуМинимальногоОстатка(Команда)
	ЗаполнитьТаблицуМинимальногоОстаткаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуМинимальногоОстаткаНаСервере()
	
   ТаблицаЗначенийПолногоКонтекста = РеквизитФормыВЗначение("ТоварыНижеМинимальногоОстатка");
   МинимальныйОстаток.ЗаполнитьТаблицуМинимальногоОстатка(ТаблицаЗначенийПолногоКонтекста);
   ЗначениеВРеквизитФормы(ТаблицаЗначенийПолногоКонтекста, "ТоварыНижеМинимальногоОстатка");
   

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьФоновоеЗадание(Команда)
	ЗапуститьФоновоеЗаданиеНаСервере();
	ПодключитьОбработчикОжидания("ПроверитьФоновоеЗадание", 1);
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьФоновоеЗаданиеНаСервере()
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Неопределено);
	УникальныйИдентификаторФЗ = ВыполнениеВФоне.ЗапуститьВыполнениеВФоне(АдресВоВременномХранилище);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФоновоеЗадание()
	
	Если ФоновоеЗаданиеЗавершено() Тогда
		
		ОтключитьОбработчикОжидания("ПроверитьФоновоеЗадание");		
		
	КонецЕсли;
	
	
КонецПроцедуры
 
&НаСервере 
Функция ФоновоеЗаданиеЗавершено()

	ФоновоеЗаданиеТоСамое = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторФЗ);	
	
	Если ФоновоеЗаданиеТоСамое = Неопределено Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	
	МассивСообщений = ФоновоеЗаданиеТоСамое.ПолучитьСообщенияПользователю(Истина);
	
	Для Каждого Сообщение из МассивСообщений Цикл
		
		Сообщение.Сообщить();	
		
	КонецЦикла;
	
		
	
	Если ФоновоеЗаданиеТоСамое.Состояние = СостояниеФоновогоЗадания.Завершено
		ИЛИ ФоновоеЗаданиеТоСамое.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		
		ЗаполнитьТЗПоИноформацииИзВременногоХранилища();
		
		Возврат Истина;	
		
	КонецЕсли;
	
	Возврат Ложь;
	
	
КонецФункции

&НаСервере 
Процедура ЗаполнитьТЗПоИноформацииИзВременногоХранилища()

	ТабЗнач = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	ЗначениеВРеквизитФормы(ТабЗнач, "ТоварыНижеМинимальногоОстатка");
	
КонецПроцедуры



