
Функция ЗакрытьЗаказ(НомерЗаказа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", НомерЗаказа);
	РезультатЗапроса = Запрос.Выполнить();        
	Выборка = РезультатЗапроса.Выбрать();
	Ответ = ПолучитьОбъектXDTO("Ответ");
	
	Если Выборка.Количество() = 0 Тогда
		
		Ответ.Текст = "Документа с номером ( " + НомерЗаказа + " ) не существует";
		ТекстXML = ПолучитьТекстXML(Ответ);
		Возврат ТекстXML;
	
	КонецЕсли;                          
	
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.Ссылка;
		
	КонецЦикла;
	
	ОбъектЗаказ = Ссылка.ПолучитьОбъект();
	
	Если ОбъектЗаказ.ПометкаУдаления = Истина Тогда
		
		Ответ.Текст = "У документа ( " + НомерЗаказа + " ) есть пометка на удаление";		
	
	ИначеЕсли ОбъектЗаказ.СтатусЗаказа <> Перечисления.СтатусыЗаказов.Готов Тогда
		
		ОбъектЗаказ.СтатусЗаказа = Перечисления.СтатусыЗаказов.Готов;
		ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		Ответ.Текст = "Успешно";
		
	Иначе
		
		Ответ.Текст = "У документа ( " + НомерЗаказа + " ) уже статус ( Готов )";

	КонецЕсли;
		
	ТекстXML = ПолучитьТекстXML(Ответ);
	Возврат ТекстXML;		
	
КонецФункции

Функция ПолучитьТекстXML(Ответ)
	
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
	ТекстXML = ЗаписьXML.Закрыть();
	Возврат ТекстXML;

КонецФункции

Функция ПолучитьОбъектXDTO(НаименованиеОбъекта)
		
	Тип = ФабрикаXDTO.Тип("http://localhost/shawarman2", НаименованиеОбъекта);
	Возврат ФабрикаXDTO.Создать(Тип);   
	
КонецФункции

