Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = 0;
	
	Для Каждого Продукт из Продукты Цикл
		СуммаДокумента = СуммаДокумента + Продукт.Сумма;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ЗаказыПродуктов.Записывать = Истина;
	Для Каждого ТекСтрокаПродукты Из Продукты Цикл
		Движение = Движения.ЗаказыПродуктов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Продукт = ТекСтрокаПродукты.Продукт;
		Движение.Количество = ТекСтрокаПродукты.Количество;
	КонецЦикла;

КонецПроцедуры

