&НаКлиенте
Процедура ПродуктыКоличествоПриИзменении(Элемент)
	РасчетЦены();	
КонецПроцедуры

&НаКлиенте
Процедура ПродуктыЦенаПриИзменении(Элемент)
	РасчетЦены();
КонецПроцедуры 

&НаКлиенте
Процедура РасчетЦены()
	
	ТекущиеДанные = Элементы.Продукты.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;  
	
	ПерерасчетСуммДокумента();
		
КонецПроцедуры

&НаКлиенте
Процедура ПродуктыСуммаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Продукты.ТекущиеДанные; 
	Если ТекущиеДанные.Цена <> 0 Тогда
		ТекущиеДанные.Количество = ТекущиеДанные.Долг / ТекущиеДанные.Цена;
		МожетБытьДробным = ПерерасчетСуммКлиент.МожетБытьДробным(ТекущиеДанные.ЕдиницаИзмерения);
		Если НЕ МожетБытьДробным Тогда
			ТекущиеДанные.Количество = Цел(ТекущиеДанные.Количество);
			Если ТекущиеДанные.Количество <> 0 Тогда
				ТекущиеДанные.Цена = ТекущиеДанные.Сумма / ТекущиеДанные.Количество;
			Иначе
				РасчетЦены();
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерерасчетСуммДокумента()
	Продукты = Объект.Продукты;
	Объект.СуммаДокумента = Продукты.Итог("Сумма");	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ПроверкаРолиНаСервере.ЕстьРоль("Директор") Тогда
		УстановитьПривилегированныйРежим(Истина);
		Объект.Заведение = ПараметрыСеанса.ТекущийСотрудник.Заведение;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
КонецПроцедуры




